{
  "sections": [
    {
      "title": "📚 What I Learned from Our PESE Presentation Class 🎤",
      "paragraphs": [
        "In our recent PESE class, every student gave a presentation and we were evaluated based on our delivery and the quality of our slides. Along with scores, we also received constructive feedback on our speaking skills and presentation design.",
        "I realized that a well-designed PowerPoint is just as vital as the topic itself. Many of us made common errors like:"
      ],
      "mistakes": [
        "Mixing different fonts across slides",
        "Text clashing with images or other text elements",
        "Using overly vibrant or distracting images",
        "Overloading slides with too much information"
      ],
      "conclusion": "Our teacher highlighted that a clear and simple presentation makes a big difference. Slides should be readable, follow a consistent design, and enhance the speaker’s message without drawing attention away from it.",
      "finalThought": "This session helped me understand how to create more effective and professional presentations in the future. These insights will definitely help improve my next PPT."
    },
    {
      "title": "🗣️ Speech and Extempore",
      "paragraphs": [
        "In our class on Speech and Extempore, we explored different categories of topics — like factual, abstract, opinion-based, and case-driven. For example, a topic like “Color of Life” can be interpreted differently depending on the type. Knowing how to identify the category helps in framing a stronger response."
      ],
      "mistakes": [
        "Not recognizing the type of topic before starting to speak",
        "Speaking too rapidly or too slowly, making it hard to follow",
        "Using complex vocabulary that may confuse the audience",
        "Going off-topic or drifting from the central point",
        "Failing to organize thoughts in a logical way",
        "Ignoring posture, eye contact, or other key aspects of body language"
      ],
      "conclusion": "This class taught me that identifying the topic type and preparing accordingly is essential. Structure, clarity, confident body language, and staying focused are key to an impactful speech.",
      "finalThought": "I'll apply these techniques to deliver stronger and clearer speeches in future sessions."
    },
    {
      "title": "💬 Group Discussion (GD) - Insights and Takeaways",
      "paragraphs": [
        "In a recent session on Group Discussions, we learned that GDs aren’t the same as team activities. It’s a setting where individuals express their thoughts independently — often with some trying to lead or dominate the conversation. I learned that it's more about presenting your ideas clearly than overpowering others."
      ],
      "mistakes": [
        "Trying too hard to take control of the discussion",
        "Interrupting others repeatedly, which feels impolite",
        "Using confusing or overly complex language",
        "Drifting away from the topic",
        "Disregarding or not acknowledging other participants’ inputs",
        "Avoiding eye contact with the group"
      ],
      "conclusion": "This session made it clear that a good GD performance comes from balance — being confident yet respectful, expressive but attentive, and always staying on track.",
      "finalThought": "These tips will definitely guide me in participating more effectively in future group discussions."
    },
    {
      "title": "Common Errors to be Avoided in Letters 📮 and Emails 📧",
      "paragraphs": [
        "In our recent class on letters and emails, we learned how important it is to communicate clearly and professionally. Writing an email or letter is not just about putting words on paper but making sure the message is correct, polite, and easy to understand. This is especially true for cover letters and professional emails, which create the first impression for jobs or official communication."
      ],
      "mistakes": [
        "A cover letter should be clear, concise, and directly related to the job or purpose.",
        "The email or letter should have a formal greeting and closing.",
        "Always use proper grammar and punctuation to maintain professionalism.",
        "Keep the content focused and relevant, avoiding unnecessary details.",
        "Use a simple and polite tone to make a positive impression."
      ],
      "commonMistakes": [
        "Spellings",
        "Punctuations",
        "Sentence formation",
        "Grammatical errors",
        "Logical sequence of ideas",
        "Confusion in synonyms and antonyms",
        "Incorrect usage of parts of speech, metaphors, similes, and personification",
        "Wrong use of active and passive voice",
        "Misuse of 1st, 2nd, and 3rd forms of verbs",
        "Use of redundant and unnecessary words",
        "Complex and very long sentences",
        "Writing in all capital letters",
        "Repetitions of words or ideas",
        "Improper use of colors, oblique (italic), and bold fonts",
        "Use of internet lingo, jargon, acronyms, short forms, slang, or emoticons",
        "Incorrect use of tenses and prepositions",
        "Writing letters/emails that are too long or too short, which confuse the reader",
        "Using informal language in professional emails",
        "Not including a clear subject line in emails",
        "Sending emails without a proper greeting or signature",
        "Writing cover letters that are generic and not personalized to the job or company"
      ],
      "conclusion": "This class made me realize that a well-written letter or email can open many doors.",
      "finalThought": "Paying attention to details like tone, structure, and correctness helps to communicate your message effectively and professionally. I’ll be more careful with these points when writing letters or emails in the future."
    }
  ]
}
